---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberX
source: html/179d4a6d-c15b-d86d-26b3-4bbd043290a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternNumberX Property

"Number on side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternNumberX { get; }
```